Revit 2027 API
PointOnEdgeEdgeIntersection.SetEdgeReference2 Method
Change the second edge or curve reference.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetEdgeReference2(
	Reference edgeReference
)
Public Sub SetEdgeReference2 (
	edgeReference As Reference
)
public:
void SetEdgeReference2(
	Reference^ edgeReference
)
member SetEdgeReference2 :
        edgeReference : Reference -> unit
Parameters
edgeReference Reference
Remarks
The referenced element may be any model element, including FamilyInstance, FormElement, or NonPlanarSketch. The reference must be of type ElementReferenceType.REFERENCE_TYPE_LINEAR, and it must correspond to a straight line.
See Also
Reference
PointOnEdgeEdgeIntersection Class
Autodesk.Revit.DB Namespace